# Задание 3 (пр7)

# вводные данные в строки
str1 = str(input('Строка 1: ')) # строка 1
str2 = str(input('Строка 2: ')) # строка 2

# вывод
print('Вывод:', str1.count(str2))